/*

Classifier Configuration file
=============================
For each event type, we configure here the classifier worker and fusion worker
configurations that are to be used when learning or searching over a given event
type. File paths provided in the various configuration sections may be either
relative or absolute. Absolute paths will be treated like normal, while relative
paths will be interpreted based on the the ECDController's work and data
directory paths.

Classifier Configurations
-------------------------
For each event type key, under the "classifiers" key, we define what
classifier implementations and configurations are to be used when learning or
searching in regards to the respective event.

Under the "classifier" section are other keys defining base classifier
implementations that should be used. These are string labels that match the name
of a sub-module placed in the ``ECDWorkers.classifiers`` module.

Each implementation key should map to a list of lists, where each inner list
consists of 3 elements and defines a specific configuration of that
implementation:
    ...
    [ 'config name/tag', 'model/file/path', 'learning/params/path' ]
    ...

The "model/file/path", when relative, will be interpreted relative to the
ECDController's configured work directory. The "learning/params/path", when
relative, will be interpreted relative to the ECDController's configured data
directory.

Scores produced by classifier workers keyed in the ECDStore under a combination
of the classifier name and the configuration name, i.e. 'classifier.config'.
Configuration names must be globally unique across all classifier
configurations, even those for other event types, to prevent conflicting IDs
when storing data, particularly when in a common store location. The
ECDController allows flexibility in where certain work is put (e.g. separated
store locations per agent), but this cannot be guaranteed.

Fusion Configuration
--------------------
Also under each event type key should be a "fusion" key. This should map to a
fusion model file path. When given as a relative path, it will be interpreted as
relative to the ECDController's configured work directory.

*/

{
    "0":  // add human event label here for readability, i.e. Skateboarding
    {
        "classifiers":
        {
            "svm_dummy":
            [
                ["dummy0", "", ""]
            ]
        },

        "fusion": "0"
    },

    "1":
    {
        "classifiers":
        {
            "svm_dummy":
            [
                ["dummy1", "", ""]
            ]
        },

        "fusion": "1"
    },

    "2":
    {
        "classifiers":
        {
            "svm_dummy":
            [
                ["dummy2", "", ""]
            ]
        },

        "fusion": "2"
    },

    "3":
    {
        "classifiers":
        {
            "svm_dummy":
            [
                ["dummy3", "", ""]
            ]
        },

        "fusion": "3"
    },

    "4":
    {
        "classifiers":
        {
            "svm_dummy":
            [
                ["dummy4", "", ""]
            ]
        },

        "fusion": "4"
    },

    // "General" section for event-less classification/ranking, or if an event
    // type is not known.
    "None":
    {
        "classifiers":
        {
            "svm_dummy":
            [
                ["dummyGeneral", "", ""]
            ]
        },

        "fusion": "general"
    }

}
